In [1]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Cockazo1%"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE SGAE_Practica")

In [2]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('information_schema',)
('mysql',)
('performance_schema',)
('sgae_practica',)
('sys',)

In [3]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Cockazo1%",
  database="SGAE_Practica"
)

In [8]:
mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('tb_genre',)
('tb_role',)

In [9]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE tb_genre (genre_id         INTEGER NOT NULL ,genre_name       CHARACTER VARYING(40) NOT NULL ,created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,created_date     DATE ,updated_date     DATE ,CONSTRAINT pk_genre PRIMARY KEY (genre_id))")

ProgrammingError: 1050 (42S01): Table 'tb_genre' already exists

In [13]:
mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('tb_genre',)
('tb_movie',)
('tb_person',)
('tb_role',)

In [10]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE tb_movie (movie_id         INTEGER NOT NULL ,movie_title      CHARACTER VARYING(100) NOT NULL ,movie_date       DATE ,movie_format     CHARACTER VARYING(50) ,movie_genre_id   INTEGER ,created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,created_date     DATE ,updated_date     DATE ,CONSTRAINT pk_movie PRIMARY KEY (movie_id) ,CONSTRAINT fk_movie_genre FOREIGN KEY (movie_genre_id) REFERENCES tb_genre (genre_id))")

In [11]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE tb_role (role_id          INTEGER NOT NULL ,role_name        CHARACTER VARYING(60) NOT NULL ,created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,created_date     DATE ,updated_date     DATE ,CONSTRAINT pk_role PRIMARY KEY (role_id))")

ProgrammingError: 1050 (42S01): Table 'tb_role' already exists

In [12]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE tb_person (person_id        INTEGER NOT NULL ,person_name      CHARACTER VARYING(100) NOT NULL ,person_country   CHARACTER VARYING(40) , person_dob       DATE NOT NULL ,person_dod       DATE ,person_parent_id INTEGER ,created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,created_date     DATE ,updated_date     DATE ,CONSTRAINT pk_person PRIMARY KEY (person_id) ,CONSTRAINT fk_person_parent FOREIGN KEY (person_parent_id) REFERENCES tb_person (person_id))")

In [14]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE tb_movie_person (movie_id         INTEGER NOT NULL ,person_id        INTEGER NOT NULL ,role_id          INTEGER NOT NULL ,movie_award_ind  CHAR(1) NOT NULL ,created_by_user  CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD' ,created_date     DATE ,updated_date     DATE ,CONSTRAINT pk_movper PRIMARY KEY (movie_id, person_id, role_id) ,CONSTRAINT fk_movper_movie FOREIGN KEY (movie_id) REFERENCES tb_movie (movie_id) ,CONSTRAINT fk_movper_person FOREIGN KEY (person_id) REFERENCES tb_person (person_id) ,CONSTRAINT fk_movper_role FOREIGN KEY (role_id) REFERENCES tb_role (role_id))")

In [15]:
mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('tb_genre',)
('tb_movie',)
('tb_movie_person',)
('tb_person',)
('tb_role',)

In [16]:
mycursor = mydb.cursor()

sql = "INSERT INTO tb_genre (genre_id, genre_name) VALUES (%s, %s)"
val = [
( 1, 'Acción'),
( 2, 'Ciencia Ficción'),
( 3, 'Comedia'),
( 4, 'Drama'),
( 7, 'Musical'),
( 8, 'Romance'),
( 9, 'Suspense'),
(10, 'Terror'),
(11, 'Bélico')  
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

9 was inserted.

In [17]:
mycursor = mydb.cursor()

sql = "INSERT INTO tb_genre (genre_id, genre_name, created_by_user) VALUES (%s, %s, %s)"
val = (5, 'Fantasía', 'apermag')

mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

1 was inserted.

In [18]:
mycursor = mydb.cursor()

sql = "INSERT INTO tb_genre (genre_id, genre_name, created_by_user, created_date, updated_date) VALUES (%s, %s, %s, %s, %s)"
val = (6, 'Melodrama', 'apermag', '2018-09-01', '2018-09-27')

mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

1 was inserted.

In [19]:
mycursor = mydb.cursor()

sql = "INSERT INTO tb_movie (movie_id, movie_title, movie_date, movie_format, movie_genre_id) VALUES (%s, %s, %s, %s, %s)"
val = [
( 1, 'Apocalypse Now', '1979-05-10', 'Film', 11),
( 2, 'Star Wars:Episode IV - A New Hope', '1977-05-25', 'Film', 2),
( 3, 'Indiana Jones and the Temple of Doom', '1984-05-08', 'Film', 1),
( 4, 'The Terminal', '2004-06-18', 'Digital', 3),
( 5, 'Jaws', '1975-01-01', 'Film', 10),
( 6, 'ET The Extraterrestrial', '1982-07-25', 'Film', 5),
( 7, 'Psycho', '1960-05-06', 'Film', 9),
( 8, 'Ocho Apellidos Vascos', '2014-03-14', 'Digital', 3),
( 9, 'Ocho Apellidos Catalanes', '2016-06-09', 'Digital', 8),
(10, 'El otro lado de la cama', '2002-09-04', 'Digital', 8),
(11, 'La Gran Familia Española', '2012-10-15', 'Digital', 3),
(12, 'El dia de la bestia', '1994-12-25', 'Film', 1),
(13, 'Braveheart', '1995-08-08', 'Film', 4),
(14, 'The Shawshank Redemption', '1992-01-07', 'Film', 4),
(15, 'Las brujas de Zugarramurdi', '2009-10-07', 'Digital', 9),
(16, 'Blade Runner', '1982-12-25', 'Digital', 2)
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

16 was inserted.

In [20]:
mycursor = mydb.cursor()

sql = "INSERT INTO tb_role (role_id, role_name) VALUES (%s, %s)"
val = [
( 1, 'Actor'),
( 2, 'Director'),
( 3, 'Productor'),
( 4, 'Guionista'),
( 5, 'Música')  
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

5 was inserted.

In [21]:
mycursor = mydb.cursor()

sql = "INSERT INTO tb_person (person_id, person_name, person_country, person_dob, person_dod, person_parent_id) VALUES (%s, %s, %s, %s, %s, %s)"
val = [
( 1, 'Francis Ford Coppola', 'United States', '1939-04-07', None, None),
( 2, 'Carmine Coppola', 'United States', '1945-07-08', None, None),
( 3, 'Marlon Brando', 'United States', '1924-04-03', '2004-07-01', None),
( 4, 'Robert Duvall', 'United States', '1931-01-05', None, None),
( 5, 'Martin Sheen', 'United States', '1940-08-03', None, None),
( 6, 'Harrison Ford', 'United States', '1942-07-13', None, None),
( 7, 'George Lucas', 'United States', '1944-05-14', None, None),
( 8, 'Gary Kurtz', 'United States', '1940-07-27', None, None),
( 9, 'Steven Spielberg', 'United States', '1946-12-18', None, None),
(10, 'John Williams', 'United States', '1928-08-08', None, None),
(11, 'Tom Hanks', 'United States', '1956-07-09', None, None),
(12, 'Catherine Zeta-Jones', 'Wales', '1969-09-25', None, None),
(13, 'Alfred Joseph Hitchcock', 'United Kingdom', '1899-08-13', '1980-04-29', None),
(14, 'Anthony Perkins', 'United States', '1934-04-04', '1992-09-08', None),
(15, 'Vera Miles', 'United States', '1929-08-23', None, None),
(16, 'Emilio Martinez Lazaro', 'Spain', '1956-09-09', None, None),
(17, 'Dani Rovira', 'Spain', '1984-07-01', None, None),
(18, 'Clara Lago', 'Spain', '1986-04-17', None, None),
(19, 'Carmen Machi', 'Spain', '1964-08-09', None, None),
(20, 'Karra Elejalde', 'Spain', '1960-03-06', None, None),
(21, 'Daniel Sanchez Arevalo', 'Spain', '1970-06-08', None, None),
(22, 'Quim Gutierrez', 'Spain', '1981-03-27', None, None),
(23, 'Robert Alamo', 'Spain', '1970-05-06', None, None),
(24, 'Hector Colome', 'Spain', '1944-10-25', '2015-02-28', None),
(25, 'Veronica Echegui', 'Spain', '1983-03-14', None, None),
(26, 'Patrick Criado', 'Spain', '1995-09-23', None, None),
(27, 'Sean Connery', 'Scotland', '1930-07-08', None, None),
(28, 'Mel Gibson', 'Australia', '1950-08-09', None, None),
(29, 'Morgan Freeman', 'United States', '1935-10-01', None, None),
(30, 'Tim Robbins', 'United States', '1949-06-07', None, None),
(41, 'Charlie Sheen', 'United States', '1965-09-03', None, 5),
(42, 'Emilio Estevez', 'United States', '1962-05-12', None, 5),
(43, 'Ramón Estevez', 'United States', '1963-08-07', None, 5),
(44, 'Reneé Estevez', 'United States', '1967-04-02', None, 5),
(45, 'Paula Speert Sheen', 'United States', '1986-01-06', None,41),
(46, 'Bob Sheen', 'United States', '2009-05-01', None,41),
(47, 'Max Sheen', 'United States', '2009-05-01', None,41),
(48, 'Sam Sheen', 'United States', '2004-03-09', None,41),
(49, 'Lola Sheen', 'United States', '2005-06-01', None,41),
(50, 'Paula Jones-Sheen', 'United States', '2003-07-06', None,45),
(51, 'Paloma Rae Estevez', 'United States', '1986-02-15', None,42),
(52, 'Taylor Levi Estevez', 'United States', '1984-06-22', None,42)
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

42 was inserted.

In [14]:
mycursor = mydb.cursor()

sql = "INSERT INTO tb_movie_person (movie_id, person_id, role_id, movie_award_ind) VALUES (%s, %s, %s, %s)"
val = [
( 1, 1, 2, 'Y'),
( 1, 1, 3, 'N'),
( 1, 1, 5, 'N'),
( 1, 2, 5, 'N'),
( 1, 3, 1, 'N'),
( 1, 4, 1, 'N'),
( 1, 5, 1, 'Y'),
( 1,41, 1, 'N'),
( 1, 6, 1, 'N'),
( 2, 6, 1, 'N'),
( 2, 7, 2, 'Y'),
( 2, 8, 3, 'N'),
( 3, 6, 1, 'N'),
( 3, 7, 4, 'N'),
( 3, 9, 2, 'N'),
( 3,10, 5, 'N'),
( 4, 9, 2, 'N'),
( 4, 9, 3, 'N'),
( 4,11, 1, 'N'),
( 4,12, 1, 'N'),
( 5, 9, 2, 'N'),
( 6, 9, 2, 'N'),
( 7,13, 1, 'N'),
( 7,13, 2, 'N'),
( 7,13, 3, 'N'),
( 7,14, 2, 'N'),
( 7,15, 2, 'N'),
( 3, 7, 1, 'N'),
( 8,16, 2, 'N'),
( 9,16, 2, 'N'),
( 8,17, 1, 'N'),
( 8,18, 1, 'N'),
( 8,19, 1, 'N'),
( 8,20, 1, 'N'),
( 9,17, 1, 'N'),
( 9,18, 1, 'N'),
( 9,19, 1, 'N'),
( 9,20, 1, 'N'),
(10,16, 2, 'N'),
(11,21, 2, 'N'),
(11,21, 4, 'N'),
(11,22, 1, 'N'),
(11,23, 1, 'N'),
(11,24, 1, 'N'),
(11,25, 1, 'N'),
(11,26, 1, 'N'),
(13,28, 1, 'Y'),
(13,28, 2, 'N'),
(14,29, 1, 'N'),
(14,30, 1, 'N'),
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

50 was inserted.

In [50]:
#Exercici 2
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

mycursor.execute("SELECT person_name, person_country\
                FROM tb_person\
                WHERE person_dod IS NULL\
                ORDER BY person_dob ASC")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('John Williams', 'United States')
('Vera Miles', 'United States')
('Sean Connery', 'Scotland')
('Robert Duvall', 'United States')
('Morgan Freeman', 'United States')
('Francis Ford Coppola', 'United States')
('Gary Kurtz', 'United States')
('Martin Sheen', 'United States')
('Harrison Ford', 'United States')
('George Lucas', 'United States')
('Carmine Coppola', 'United States')
('Steven Spielberg', 'United States')
('Tim Robbins', 'United States')
('Mel Gibson', 'Australia')
('Tom Hanks', 'United States')
('Emilio Martinez Lazaro', 'Spain')
('Karra Elejalde', 'Spain')
('Emilio Estevez', 'United States')
('Ramón Estevez', 'United States')
('Carmen Machi', 'Spain')
('Charlie Sheen', 'United States')
('Reneé Estevez', 'United States')
('Catherine Zeta-Jones', 'Wales')
('Robert Alamo', 'Spain')
('Daniel Sanchez Arevalo', 'Spain')
('Quim Gutierrez', 'Spain')
('Veronica Echegui', 'Spain')
('Taylor Levi Estevez', 'United States')
('Dani Rovira', 'Spain')
('Paula Speert Sheen', 'United States')
('Paloma Rae Estevez', 'United States')
('Clara Lago', 'Spain')
('Patrick Criado', 'Spain')
('Paula Jones-Sheen', 'United States')
('Sam Sheen', 'United States')
('Lola Sheen', 'United States')
('Bob Sheen', 'United States')
('Max Sheen', 'United States')

In [75]:
#Exercici 3
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

mycursor.execute("SELECT tb_genre.genre_name, tb_movie.movie_genre_id \
                FROM tb_genre\
                INNER JOIN tb_movie \
                ON tb_genre.genre_id=tb_movie.movie_genre_id\
                GROUP BY genre_id ORDER BY 1")
                
                

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Acción', 1)
('Bélico', 11)
('Ciencia Ficción', 2)
('Comedia', 3)
('Drama', 4)
('Fantasía', 5)
('Romance', 8)
('Suspense', 9)
('Terror', 10)

In [80]:
mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('tb_genre',)
('tb_movie',)
('tb_movie_person',)
('tb_person',)
('tb_role',)

In [98]:
#Exercici 4
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

mycursor.execute("SELECT\
                tb_person.person_name,\
                tb_role.role_name, \
                tb_movie_person.movie_id,\
                tb_movie_person.person_id,\
                tb_movie_person.role_id,\
                FROM tb_movie_person \
                INNER JOIN tb_role\
                ON tb_movie_person.role_id=tb_role.name\
                INNER JOIN tb_person\
                ON tb_movie_person.person_id=tb_person.person_name\
                GROUP BY role_name ORDER BY 1")
                
                

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FROM tb_movie_person                 INNER JOIN tb_role                ON tb_mov' at line 1

In [100]:
#Exercici 5
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

sql = "INSERT INTO tb_genre (genre_id, genre_name) VALUES (%s, %s)"
val = ( 69, 'Documental')

mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

1 was inserted.

In [101]:
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM tb_genre")
        
myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'Acción', 'OS_SGAD', None, None)
(2, 'Ciencia Ficción', 'OS_SGAD', None, None)
(3, 'Comedia', 'OS_SGAD', None, None)
(4, 'Drama', 'OS_SGAD', None, None)
(5, 'Fantasía', 'apermag', None, None)
(6, 'Melodrama', 'apermag', datetime.date(2018, 9, 1), datetime.date(2018, 9, 27))
(7, 'Musical', 'OS_SGAD', None, None)
(8, 'Romance', 'OS_SGAD', None, None)
(9, 'Suspense', 'OS_SGAD', None, None)
(10, 'Terror', 'OS_SGAD', None, None)
(11, 'Bélico', 'OS_SGAD', None, None)
(69, 'Documental', 'OS_SGAD', None, None)

In [108]:
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM tb_movie")
        
myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 8, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(11, 'La Gran Familia Española', datetime.date(2012, 10, 15), 'Digital', 3, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)

In [111]:
#Exercici 6
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

mycursor.execute("DELETE FROM tb_movie WHERE movie_title = 'La Gran Familia Española'")

mydb.commit()

print(mycursor.rowcount, "was deleted.")

1 was inserted.

In [112]:
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM tb_movie")
        
myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 8, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)

In [113]:
#Exercici 7
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

mycursor.execute("UPDATE tb_movie \
                SET movie_genre_id = 3\
                WHERE movie_title = 'Ocho apellidos catalanes'")

mydb.commit()

print(mycursor.rowcount, "was updated.")

1 was updated.

In [114]:
import mysql.connector

mydb = mysql.connector.connect(host="localhost",user="root",password="Cockazo1%",database="SGAE_Practica")

mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM tb_movie")
        
myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 3, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)